jsbackend/__artillery__/fruits.yml
config:
  target: "http://jsbackend:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "fruits.csv"
    fields:
      - "type"
      - "name"

scenarios:
  - name: "Create new fruit"
    flow:
      - post:
          url: "/Fruits"
          json:
            type: "{{ type }}"
            name: "{{ name }}"
          capture:
            - json: "$._id"
              as: "fruitId"
      - get:
          url: "/Fruits"
      - delete:
          url: "/Fruits/{{ fruitId }}"